import pandas as pd

file_name='/Users/junyeong/Desktop/DKU/2023/1st/Capstone/Fake-Message-Detective/fake_message_detective/main/training_data1.xlsx'

df = pd.read_excel(file_name)

banmal = []
jondae = []

for c in df.columns:
     if '반말' in c :
          for sentence in df[c].astype(str):
               banmal.append(sentence)
     
for c in df.columns:
     if '존댓말' in c :
          for sentence in df[c].astype(str):
               jondae.append(sentence)

dataset_sentences = banmal[:10000] + jondae[:10000]

dataset_labels = [0] * 10000 + [1] * 10000

phishing_keyword = [
    '계정', '확인', '로그인', '비밀번호', '보안', '업데이트', '사기', '이메일', '링크', '주의',
    '사이트', '가입', '인증', '속임수', '도용', '사회공학', '정보', '알림', '해킹', '조치',
    '접속', '경고', '보호', '이상', '소비자', '부정확', '사칭', '불법', '악용', '목적',
    '가짜', '확인메일', '절차', '접속기록', '불편', '사기성', '피해', '주소', '접속정보', '기록',
    '패스워드', '업데이트안내', '제한', '이용정지', '경고메시지', '신청', '차단', '문제', '보상', '긴급',
    '요청', '개인정보', '보안강화', '연락처', '해킹위험', '가입승인', '복구', '즉시', '고객정보', '비밀번호변경',
    '송금', '인증서', '금지', '손실', '문의', '이상동작', '업데이트요청', '피해사례', '접속위험', '제재',
    '개인정보유출', '피해방지', '기한', '승인', '경찰', '서비스이용정지', '주의사항', '제안', '신분증', '혜택',
    '접속기록조회', '잠재적', '이용약관', '사용', '목록', '금융', '차량정보', '휴면', '보안사고', '가맹점',
    '세부사항', '절차완료', '사전경고', '고객센터', '사용자', '이슈', '보증', '공지사항', '결제', '경쟁자','계좌', '사용자인증', '서비스', '경우', '경로', '이메일주소', '인증번호', '통보', '인증링크',
    '인증코드', '확인코드', '확인메일', '인증메일', '재인증', '개인정보확인', '보안절차', '접속로그',
    '접속기록', '재확인', '이용안내', '계좌번호', '계정정지', '휴면계정', '개인정보관리', '인증문자',
    '필수정보', '휴대폰번호', '휴대폰인증', '인증절차', '변경사항', '변경안내', '변경절차', '신분확인',
    '금융기관', '조작', '연장', '수정', '갱신', '피해신고', '신분증사본', '인터넷뱅킹', '거래정지',
    '주민등록번호', '가맹점정보', '공지사항확인', '서비스중지', '계정활성화', '계정인증', '계정보호', '시스템점검',
    '업데이트안내메일', '시스템확인', '긴급조치', '정보보호', '인터넷뱅킹이용', '금융사기', '보안문자', '인증서업데이트',
    '계정유효성', '정보변경', '전자서명', '신분확인서', '비밀번호분실', '신용카드', '확인바람', '예방법', '안전점검',
    '사용제한', '이용안내서', '정보확인', '사용금지', '접속차단', '접근금지', '재사용', '보안점검', '보안감사',
    '계정휴면', '계정정지안내', '비밀번호재설정', '비밀번호확인', '실명인증', '정보수정', '접속권한', '해킹공격',
    '악성코드', '사기피해', '회원인증', '로그인확인', '이용신청', '접속기록조회요청', '문서확인', '서비스이용',
    '요청사항', '정보수집', '개인정보보호', '사용환경', '공지사항안내', '계정활성화안내', '보안인증', '계정인증안내'
]